wosayttn/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
/*----------------------------------------------------------------------------*/
/* Global variables */

/*----------------------------------------------------------------------------*/
/* Helper flags for complex dependencies */

/* Indicates whether we expect mbedtls_entropy_init
 * to initialize some strong entropy source. */
#if !defined(MBEDTLS_NO_DEFAULT_ENTROPY_SOURCES) && \
    (!defined(MBEDTLS_NO_PLATFORM_ENTROPY) ||      \
    defined(MBEDTLS_ENTROPY_HARDWARE_ALT) ||    \
    defined(ENTROPY_NV_SEED))
#define ENTROPY_HAVE_STRONG
#endif


/*----------------------------------------------------------------------------*/
/* Helper Functions */

#if defined(__unix__) || (defined(__APPLE__) && defined(__MACH__))
static int redirect_output(FILE *out_stream, const char *path)
{
    int out_fd, dup_fd;
    FILE *path_stream;

    out_fd = fileno(out_stream);
    dup_fd = dup(out_fd);

    if (dup_fd == -1) {
        return -1;
    }

    path_stream = fopen(path, "w");
    if (path_stream == NULL) {
        close(dup_fd);
        return -1;
    }

    fflush(out_stream);
    if (dup2(fileno(path_stream), out_fd) == -1) {
        close(dup_fd);
        fclose(path_stream);
        return -1;
    }

    fclose(path_stream);
    return dup_fd;
}

static int restore_output(FILE *out_stream, int dup_fd)
{
    int out_fd = fileno(out_stream);

    fflush(out_stream);
    if (dup2(dup_fd, out_fd) == -1) {
        close(out_fd);
        close(dup_fd);
        return -1;
    }

    close(dup_fd);
    return 0;
}
#endif /* __unix__ || __APPLE__ __MACH__ */


/*----------------------------------------------------------------------------*/
/* test patterns */
#include "dat.h"

typedef struct {
    const char* base;
    const char* limit;
    unsigned int ofs;
} MYFILE;

MYFILE g_myfile;

char* myfgets(char* s, int n, FILE* f)
{
    MYFILE* myfile;
    int32_t i;
    int32_t ofs;
    const char* pu8Base, * pu8Limit;

    myfile = (MYFILE*)f;

    pu8Base = myfile->base;
    pu8Limit = myfile->limit;
    ofs = myfile->ofs;

    /* End of file check */
    if(pu8Base + ofs >= pu8Limit)
        return 0;

    /* Seek to offset */
    pu8Base += ofs;

    /* Check length to read */
    if(pu8Base + n > pu8Limit)
    {
        /* touch the eof */
        n = (int)(pu8Limit - pu8Base);
    }

    for(i = 0; i < n; i++)
    {
        s[i] = pu8Base[i];

        /* Check new line */
        if((pu8Base[i] == 0x0d) && (pu8Base[i + 1] == 0x0a))
        {
            s[i] = 0x0a;
            i++;

            /* ahead one byte due to CRLF --> LF */
            myfile->ofs += 1;
            break;
        }

        if(pu8Base[i] == 0x0a)
        {
            i++;
            break;
        }
    }

    /* update file offset */
    myfile->ofs += i;

    /* append 0 */
    if(i < n)
        s[i] = 0;

    return s;
}

int myfeof(FILE* f)
{
    MYFILE* myfile;
    myfile = (MYFILE*)f;
    if(myfile->base + myfile->ofs >= myfile->limit)
        return 1;
    return 0;
}

void myfclose(FILE* f)
{
    MYFILE* myfile;

    myfile = (MYFILE*)f;

    myfile->ofs = 0;
}

FILE* myfopen(char const* fname, char const* mode)
{
    g_myfile.base = _dat;
    g_myfile.limit = _dat + sizeof(_dat);
    g_myfile.ofs = 0;
    return (FILE*)&g_myfile;
}


/*----------------------------------------------------------------------------*/
/* Test Suite Code */


#define TEST_SUITE_ACTIVE

#if defined(MBEDTLS_HKDF_C)
#include "mbedtls/hkdf.h"
#include "md_wrap.h"

void test_test_hkdf(int md_alg, data_t *ikm, data_t *salt, data_t *info,
                    data_t *expected_okm)
{
    int ret;
    unsigned char okm[128] = { '\0' };

    MD_PSA_INIT();

    const mbedtls_md_info_t *md = mbedtls_md_info_from_type(md_alg);
    TEST_ASSERT(md != NULL);

    TEST_ASSERT(expected_okm->len <= sizeof(okm));

    ret = mbedtls_hkdf(md, salt->x, salt->len, ikm->x, ikm->len,
                       info->x, info->len, okm, expected_okm->len);
    TEST_ASSERT(ret == 0);

    TEST_MEMORY_COMPARE(okm, expected_okm->len,
                        expected_okm->x, expected_okm->len);

exit:
    MD_PSA_DONE();
}

void test_test_hkdf_wrapper( void ** params )
{
    data_t data1 = {(uint8_t *) params[1], ((mbedtls_test_argument_t *) params[2])->len};
    data_t data3 = {(uint8_t *) params[3], ((mbedtls_test_argument_t *) params[4])->len};
    data_t data5 = {(uint8_t *) params[5], ((mbedtls_test_argument_t *) params[6])->len};
    data_t data7 = {(uint8_t *) params[7], ((mbedtls_test_argument_t *) params[8])->len};

    test_test_hkdf( ((mbedtls_test_argument_t *) params[0])->sint, &data1, &data3, &data5, &data7 );
}

void test_test_hkdf_extract(int md_alg,
                            data_t *ikm,
                            data_t *salt,
                            data_t *prk)
{
    int ret;
    unsigned char *output_prk = NULL;
    size_t output_prk_len;

    MD_PSA_INIT();

    const mbedtls_md_info_t *md = mbedtls_md_info_from_type(md_alg);
    TEST_ASSERT(md != NULL);

    output_prk_len = mbedtls_md_get_size(md);
    TEST_CALLOC(output_prk, output_prk_len);

    ret = mbedtls_hkdf_extract(md, salt->x, salt->len,
                               ikm->x, ikm->len, output_prk);
    TEST_ASSERT(ret == 0);

    TEST_MEMORY_COMPARE(output_prk, output_prk_len, prk->x, prk->len);

exit:
    mbedtls_free(output_prk);
    MD_PSA_DONE();
}

void test_test_hkdf_extract_wrapper( void ** params )
{
    data_t data1 = {(uint8_t *) params[1], ((mbedtls_test_argument_t *) params[2])->len};
    data_t data3 = {(uint8_t *) params[3], ((mbedtls_test_argument_t *) params[4])->len};
    data_t data5 = {(uint8_t *) params[5], ((mbedtls_test_argument_t *) params[6])->len};

    test_test_hkdf_extract( ((mbedtls_test_argument_t *) params[0])->sint, &data1, &data3, &data5 );
}

void test_test_hkdf_expand(int md_alg,
                           data_t *info,
                           data_t *prk,
                           data_t *okm)
{
    enum { OKM_LEN  = 1024 };
    int ret;
    unsigned char *output_okm = NULL;

