wosayttn/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
    MD_PSA_INIT();

    const mbedtls_md_info_t *md = mbedtls_md_info_from_type(md_alg);
    TEST_ASSERT(md != NULL);

    TEST_CALLOC(output_okm, OKM_LEN);

    TEST_ASSERT(prk->len == mbedtls_md_get_size(md));
    TEST_ASSERT(okm->len < OKM_LEN);

    ret = mbedtls_hkdf_expand(md, prk->x, prk->len,
                              info->x, info->len,
                              output_okm, OKM_LEN);
    TEST_ASSERT(ret == 0);
    TEST_MEMORY_COMPARE(output_okm, okm->len, okm->x, okm->len);

exit:
    mbedtls_free(output_okm);
    MD_PSA_DONE();
}

void test_test_hkdf_expand_wrapper( void ** params )
{
    data_t data1 = {(uint8_t *) params[1], ((mbedtls_test_argument_t *) params[2])->len};
    data_t data3 = {(uint8_t *) params[3], ((mbedtls_test_argument_t *) params[4])->len};
    data_t data5 = {(uint8_t *) params[5], ((mbedtls_test_argument_t *) params[6])->len};

    test_test_hkdf_expand( ((mbedtls_test_argument_t *) params[0])->sint, &data1, &data3, &data5 );
}

void test_test_hkdf_extract_ret(int hash_len, int ret)
{
    int output_ret;
    unsigned char *salt = NULL;
    unsigned char *ikm = NULL;
    unsigned char *prk = NULL;
    size_t salt_len, ikm_len;
    struct mbedtls_md_info_t fake_md_info;

    memset(&fake_md_info, 0, sizeof(fake_md_info));
    fake_md_info.type = MBEDTLS_MD_NONE;
    fake_md_info.size = hash_len;

    TEST_CALLOC(prk, MBEDTLS_MD_MAX_SIZE);
    salt_len = 0;
    ikm_len = 0;

    output_ret = mbedtls_hkdf_extract(&fake_md_info, salt, salt_len,
                                      ikm, ikm_len, prk);
    TEST_ASSERT(output_ret == ret);

exit:
    mbedtls_free(prk);
}

void test_test_hkdf_extract_ret_wrapper( void ** params )
{

    test_test_hkdf_extract_ret( ((mbedtls_test_argument_t *) params[0])->sint, ((mbedtls_test_argument_t *) params[1])->sint );
}

void test_test_hkdf_expand_ret(int hash_len, int prk_len, int okm_len, int ret)
{
    int output_ret;
    unsigned char *info = NULL;
    unsigned char *prk = NULL;
    unsigned char *okm = NULL;
    size_t info_len;
    struct mbedtls_md_info_t fake_md_info;

    memset(&fake_md_info, 0, sizeof(fake_md_info));
    fake_md_info.type = MBEDTLS_MD_NONE;
    fake_md_info.size = hash_len;

    info_len = 0;

    if (prk_len > 0) {
        TEST_CALLOC(prk, prk_len);
    }

    if (okm_len > 0) {
        TEST_CALLOC(okm, okm_len);
    }

    output_ret = mbedtls_hkdf_expand(&fake_md_info, prk, prk_len,
                                     info, info_len, okm, okm_len);
    TEST_ASSERT(output_ret == ret);

exit:
    mbedtls_free(prk);
    mbedtls_free(okm);
}

void test_test_hkdf_expand_ret_wrapper( void ** params )
{

    test_test_hkdf_expand_ret( ((mbedtls_test_argument_t *) params[0])->sint, ((mbedtls_test_argument_t *) params[1])->sint, ((mbedtls_test_argument_t *) params[2])->sint, ((mbedtls_test_argument_t *) params[3])->sint );
}
#endif /* MBEDTLS_HKDF_C */



/*----------------------------------------------------------------------------*/
/* Test dispatch code */


/**
 * \brief       Evaluates an expression/macro into its literal integer value.
 *              For optimizing space for embedded targets each expression/macro
 *              is identified by a unique identifier instead of string literals.
 *              Identifiers and evaluation code is generated by script:
 *              generate_test_code.py
 *
 * \param exp_id    Expression identifier.
 * \param out_value Pointer to int to hold the integer.
 *
 * \return       0 if exp_id is found. 1 otherwise.
 */
int get_expression(int32_t exp_id, intmax_t *out_value)
{
    int ret = KEY_VALUE_MAPPING_FOUND;

    (void) exp_id;
    (void) out_value;

    switch (exp_id) {

#if defined(MBEDTLS_HKDF_C)

    case 0:
    {
        *out_value = MBEDTLS_ERR_HKDF_BAD_INPUT_DATA;
    }
    break;
    case 1:
    {
        *out_value = MBEDTLS_MD_SHA256;
    }
    break;
    case 2:
    {
        *out_value = MBEDTLS_MD_SHA1;
    }
    break;
#endif

    default:
    {
        ret = KEY_VALUE_MAPPING_NOT_FOUND;
    }
    break;
    }
    return ret;
}


/**
 * \brief       Checks if the dependency i.e. the compile flag is set.
 *              For optimizing space for embedded targets each dependency
 *              is identified by a unique identifier instead of string literals.
 *              Identifiers and check code is generated by script:
 *              generate_test_code.py
 *
 * \param dep_id    Dependency identifier.
 *
 * \return       DEPENDENCY_SUPPORTED if set else DEPENDENCY_NOT_SUPPORTED
 */
int dep_check(int dep_id)
{
    int ret = DEPENDENCY_NOT_SUPPORTED;

    (void) dep_id;

    switch (dep_id) {

#if defined(MBEDTLS_HKDF_C)

    case 0:
    {
#if defined(MBEDTLS_MD_CAN_SHA256)
        ret = DEPENDENCY_SUPPORTED;
#else
        ret = DEPENDENCY_NOT_SUPPORTED;
#endif
    }
    break;
    case 1:
    {
#if defined(MBEDTLS_MD_CAN_SHA1)
        ret = DEPENDENCY_SUPPORTED;
#else
        ret = DEPENDENCY_NOT_SUPPORTED;
#endif
    }
    break;
#endif


    default:
        break;
    }
    return ret;
}


/**
 * \brief       Function pointer type for test function wrappers.
 *
 * A test function wrapper decodes the parameters and passes them to the
 * underlying test function. Both the wrapper and the underlying function
 * return void. Test wrappers assume that they are passed a suitable
 * parameter array and do not perform any error detection.
 *
 * \param param_array   The array of parameters. Each element is a `void *`
 *                      which the wrapper casts to the correct type and
 *                      dereferences. Each wrapper function hard-codes the
 *                      number and types of the parameters.
 */
typedef void (*TestWrapper_t)(void **param_array);


/**
 * \brief       Table of test function wrappers. Used by dispatch_test().
 *              This table is populated by script:
 *              generate_test_code.py
 *
 */
TestWrapper_t test_funcs[] =
{
    /* Function Id: 0 */

#if defined(MBEDTLS_HKDF_C)
    test_test_hkdf_wrapper,
#else
    NULL,
#endif
    /* Function Id: 1 */

