wosayttn/M55M1BSP/SampleCode/Crypto/mbedTLS_HKDF/test_suite_hkdf.c
}


void SysTick_Handler()
{
    g_u32Ticks++;
}

/**
 * \brief       Program main. Invokes platform specific execute_tests().
 *
 * \param argc      Command line arguments count.
 * \param argv      Array of command line arguments.
 *
 * \return       Exit code.
 */
int main()
{
    int argc;
    const char* argv[] = { 0 };

    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O. */
    SYS_Init();

    /* Init Debug UART for printf */
    InitDebugUart();
    /* Lock protected registers */
    SYS_LockReg();

    SysTick_Config(SystemCoreClock / 1000);

    printf("MBEDTLS HKDF self test ...\n");

#if defined(MBEDTLS_TEST_HOOKS)
    extern void (*mbedtls_test_hook_test_fail)( const char * test, int line, const char * file );
    mbedtls_test_hook_test_fail = &mbedtls_test_fail;
#if defined(MBEDTLS_ERROR_C)
    mbedtls_test_hook_error_add = &mbedtls_test_err_add_check;
#endif
#endif

    int ret = mbedtls_test_platform_setup();
    if( ret != 0 )
    {
        mbedtls_fprintf( stderr,
                         "FATAL: Failed to initialize platform - error %d\n",
                         ret );
        return( -1 );
    }

#if (defined(MBEDTLS_HKDF_GEN_ALT))
    printf("Hardware Accellerator Enabled.\n");
#else
    printf("Pure software crypto running.\n");
#endif

    SysTick_Config(SystemCoreClock / 1000);

    g_u32Ticks = 0;
    ret = execute_tests( argc, argv );
    printf("Total elapsed time is %d ms\n", g_u32Ticks);

    mbedtls_test_platform_teardown();

    for(;;) {}
}